RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_adc16_regs.h
/* BUS_RESULT register group index macro definition */
#define ADC16_BUS_RESULT_CHN0 (0UL)
#define ADC16_BUS_RESULT_CHN1 (1UL)
#define ADC16_BUS_RESULT_CHN2 (2UL)
#define ADC16_BUS_RESULT_CHN3 (3UL)
#define ADC16_BUS_RESULT_CHN4 (4UL)
#define ADC16_BUS_RESULT_CHN5 (5UL)
#define ADC16_BUS_RESULT_CHN6 (6UL)
#define ADC16_BUS_RESULT_CHN7 (7UL)
#define ADC16_BUS_RESULT_CHN8 (8UL)
#define ADC16_BUS_RESULT_CHN9 (9UL)
#define ADC16_BUS_RESULT_CHN10 (10UL)
#define ADC16_BUS_RESULT_CHN11 (11UL)
#define ADC16_BUS_RESULT_CHN12 (12UL)
#define ADC16_BUS_RESULT_CHN13 (13UL)
#define ADC16_BUS_RESULT_CHN14 (14UL)
#define ADC16_BUS_RESULT_CHN15 (15UL)

/* SEQ_QUE register group index macro definition */
#define ADC16_SEQ_QUE_CFG0 (0UL)
#define ADC16_SEQ_QUE_CFG1 (1UL)
#define ADC16_SEQ_QUE_CFG2 (2UL)
#define ADC16_SEQ_QUE_CFG3 (3UL)
#define ADC16_SEQ_QUE_CFG4 (4UL)
#define ADC16_SEQ_QUE_CFG5 (5UL)
#define ADC16_SEQ_QUE_CFG6 (6UL)
#define ADC16_SEQ_QUE_CFG7 (7UL)
#define ADC16_SEQ_QUE_CFG8 (8UL)
#define ADC16_SEQ_QUE_CFG9 (9UL)
#define ADC16_SEQ_QUE_CFG10 (10UL)
#define ADC16_SEQ_QUE_CFG11 (11UL)
#define ADC16_SEQ_QUE_CFG12 (12UL)
#define ADC16_SEQ_QUE_CFG13 (13UL)
#define ADC16_SEQ_QUE_CFG14 (14UL)
#define ADC16_SEQ_QUE_CFG15 (15UL)

/* PRD_CFG register group index macro definition */
#define ADC16_PRD_CFG_CHN0 (0UL)
#define ADC16_PRD_CFG_CHN1 (1UL)
#define ADC16_PRD_CFG_CHN2 (2UL)
#define ADC16_PRD_CFG_CHN3 (3UL)
#define ADC16_PRD_CFG_CHN4 (4UL)
#define ADC16_PRD_CFG_CHN5 (5UL)
#define ADC16_PRD_CFG_CHN6 (6UL)
#define ADC16_PRD_CFG_CHN7 (7UL)
#define ADC16_PRD_CFG_CHN8 (8UL)
#define ADC16_PRD_CFG_CHN9 (9UL)
#define ADC16_PRD_CFG_CHN10 (10UL)
#define ADC16_PRD_CFG_CHN11 (11UL)
#define ADC16_PRD_CFG_CHN12 (12UL)
#define ADC16_PRD_CFG_CHN13 (13UL)
#define ADC16_PRD_CFG_CHN14 (14UL)
#define ADC16_PRD_CFG_CHN15 (15UL)

/* SAMPLE_CFG register group index macro definition */
#define ADC16_SAMPLE_CFG_CHN0 (0UL)
#define ADC16_SAMPLE_CFG_CHN1 (1UL)
#define ADC16_SAMPLE_CFG_CHN2 (2UL)
#define ADC16_SAMPLE_CFG_CHN3 (3UL)
#define ADC16_SAMPLE_CFG_CHN4 (4UL)
#define ADC16_SAMPLE_CFG_CHN5 (5UL)
#define ADC16_SAMPLE_CFG_CHN6 (6UL)
#define ADC16_SAMPLE_CFG_CHN7 (7UL)
#define ADC16_SAMPLE_CFG_CHN8 (8UL)
#define ADC16_SAMPLE_CFG_CHN9 (9UL)
#define ADC16_SAMPLE_CFG_CHN10 (10UL)
#define ADC16_SAMPLE_CFG_CHN11 (11UL)
#define ADC16_SAMPLE_CFG_CHN12 (12UL)
#define ADC16_SAMPLE_CFG_CHN13 (13UL)
#define ADC16_SAMPLE_CFG_CHN14 (14UL)
#define ADC16_SAMPLE_CFG_CHN15 (15UL)

/* ADC16_PARAMS register group index macro definition */
#define ADC16_ADC16_PARAMS_ADC16_PARA00 (0UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA01 (1UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA02 (2UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA03 (3UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA04 (4UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA05 (5UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA06 (6UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA07 (7UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA08 (8UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA09 (9UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA10 (10UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA11 (11UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA12 (12UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA13 (13UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA14 (14UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA15 (15UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA16 (16UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA17 (17UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA18 (18UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA19 (19UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA20 (20UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA21 (21UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA22 (22UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA23 (23UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA24 (24UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA25 (25UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA26 (26UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA27 (27UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA28 (28UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA29 (29UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA30 (30UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA31 (31UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA32 (32UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA33 (33UL)


#endif /* HPM_ADC16_H */
